Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОчередьБронирования</xr:Item>
				<xr:Item>InformationRegister.СтатусыОбъектовНедвижимости</xr:Item>
				<xr:Item>InformationRegister.СрокиБронированияОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСрокаБронирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииБронирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляСнятияБронирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомКлик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацииБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацииБронирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бронирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеБронирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Бронирование/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	ВидОперации = Неопределено;
	
	Если Параметры.Свойство("Ключ") Тогда
		ВидОперации = Параметры.Ключ.ВидОперации;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) и Параметры.Свойство("ЗначенияЗаполнения")
		и ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") и Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ВидОперации) и Параметры.Свойство("ЗначениеКопирования") Тогда
		ВидОперации =  Параметры.ЗначениеКопирования.ВидОперации;	
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВыбраннаяФорма = "ФормаВыбораВидаОперации";
		Возврат;
	КонецЕсли;
	
	СоотвествиеФормИВидовОпераций 	= ПолучитьСоотвествиеФормИВидовОпераций();
	ВыбраннаяФорма 					= СоотвествиеФормИВидовОпераций[ВидОперации];	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоотвествиеФормИВидовОпераций() Экспорт

	СоотвествиеФормИВидовОпераций = Новый Соответствие;
	СоотвествиеФормИВидовОпераций.Вставить(Перечисления.ВидыОперацииБронирования.Бронирование, 			"ФормаДокументаБронирование");
	СоотвествиеФормИВидовОпераций.Вставить(Перечисления.ВидыОперацииБронирования.СнятиеБронирования, 	"ФормаДокументаСнятиеБронирования");
	
	Возврат СоотвествиеФормИВидовОпераций;

КонецФункции // ПолучитьСоотвествиеФормИВидовОпераций()

#КонецОбласти

#Область СтандартныеПодсистемы_ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	//Позволяет скрыть служебные реквизиты
	//Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
//Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
//    Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
//    Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
//КонецПроцедуры

#КонецОбласти
